tap "homebrew/cask"
tap "homebrew/cask-fonts"

# --- CLI & utilities ---
brew "git"
brew "wget"
brew "htop"
brew "fzf"
brew "ripgrep"
brew "jq"
brew "less"
brew "tree"
brew "mas"

# --- Languages & runtimes ---
brew "node"
brew "go"
brew "python@3.12"
brew "typescript"
brew "dotnet"

# --- Node/Python managers & tooling ---
brew "nvm"
brew "pyenv"
brew "pipx"
brew "yarn"
brew "pnpm"
brew "poetry"
brew "black"
brew "flake8"
brew "pytest"
brew "prettier"
brew "eslint"

# --- Cloud & DevOps ---
brew "awscli"
brew "azure-cli"
brew "google-cloud-sdk"
brew "terraform"
brew "ansible"
brew "kubectl"
brew "helm"

# --- AI / ML ---
brew "ollama"
brew "huggingface-cli"
brew "openai"

# --- Open-source / build tools ---
brew "gh"
brew "ghq"
brew "make"
brew "cmake"
brew "pkg-config"
brew "gettext"
brew "neovim"
brew "pre-commit"

# --- Containers (Docker alternative) ---
brew "podman"            # CLI + VM on macOS
# cask "podman-desktop"  # (optional) GUI for Podman

# --- Terminals & dev apps ---
cask "warp"
cask "ghostty"
cask "visual-studio-code"
cask "nosql-workbench"    # DynamoDB visual modeler

# --- Productivity / utilities ---
cask "raycast"
cask "rectangle"
cask "dashlane"
cask "stats"
cask "keepingyouawake"
cask "google-chrome"
cask "github"             # GitHub Desktop GUI

# --- Communication & creative (Mac App Store) ---
mas "Slack", id: 803453959
mas "Signal", id: 874139669
mas "Pixelmator Pro", id: 1289583905
mas "ScreenFlow", id: 403388562

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"
