# Brewfile for machine-macos
# This file contains all packages and applications to install via Homebrew

# Taps - Additional Homebrew repositories
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Development Tools
brew "git"
brew "node"
brew "python@3.11"
brew "rbenv"
brew "ruby-build"
brew "go"

# Shell & Terminal Utilities
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "starship"
brew "tmux"
brew "tree"
brew "wget"
brew "curl"
brew "htop"
brew "jq"

# Development Utilities
brew "gh"  # GitHub CLI
brew "awscli"
brew "terraform"
brew "ansible"
brew "docker"
brew "docker-compose"

# Database Tools
brew "postgresql@14"
brew "redis"
brew "sqlite"

# Programming Language Version Managers
brew "nvm"
brew "pyenv"

# Productivity Apps (via Cask)
cask "google-chrome"
cask "firefox"
cask "visual-studio-code"
cask "iterm2"
cask "slack"
cask "zoom"
cask "rectangle"
cask "alfred"
cask "1password"
cask "docker"

# Design & Media
cask "figma"
cask "vlc"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-hack-nerd-font"

# Optional: Mac App Store apps (requires mas-cli)
# brew "mas"
# mas "Xcode", id: 497799835
# mas "Keynote", id: 409183694
